Catalogs/КластерСервераПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КластерСервераПриложений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Защищен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КластерСервераПриложений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипПодключения = "RAS";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБазы_Отладка(Команда)
	
	СвойстваИнформационныхБаз = ПолучитьСвойстваИнформационныхБаз();

КонецПроцедуры

&НаСервере
Функция ПолучитьСвойстваИнформационныхБаз()

	//ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера();
	//Возврат АдминистрированиеКластера.СвойстваИнформационныхБаз(Объект.ИдентификаторКластера, ПараметрыАдминистрированияКластера);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()

		
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификатор(Команда)
	
	УстановитьИдентификатор(Параметры);	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьИдентификатор(Параметры)
	
	Отказ = Ложь;
	
	//Если  Объект.ТипПодключения = 0 Тогда
		Если Не ЗначениеЗаполнено(Объект.АдресСервераАдминистрирования) Тогда
			Сообщить("Не заполнен адрес сервера", СтатусСообщения.Важное);
			Отказ = Истина;		
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(Объект.ПортСервераАдминистрирования) Тогда
			Сообщить("Не заполнен порт сервера", СтатусСообщения.Важное);
			Отказ = Истина;		
		КонецЕсли;
	//ИначеЕсли Объект.ТипПодключения = 1 Тогда
	//	Если Не ЗначениеЗаполнено(Объект.АдресАгентаСервера) Тогда
	//		Сообщить("Не заполнен адрес сервера", СтатусСообщения.Важное);
	//		Отказ = Истина;		
	//	КонецЕсли;  
	//	
	//	Если Не ЗначениеЗаполнено(Объект.ПортАгентаСервера) Тогда
	//		Сообщить("Не заполнен порт сервера", СтатусСообщения.Важное);
	//		Отказ = Истина;		
	//	КонецЕсли;
	//КонецЕсли;

	Если Не Отказ Тогда
		Объект.ИдентификаторКластера = ПолучитьИдентификаторНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		ПоказатьПредупреждение(, "Успешное подключение");
	Иначе
		ПоказатьПредупреждение(, "Не удалось подключиться");
	КонецЕсли;
	 	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторНаСервере()
	
	ИдентификаторКластера = Справочники.КластерСервераПриложений.ПолучитьИдентификаторКластера(Объект);
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		УстановитьМакетОписанияКластера();	
	КонецЕсли;
	
	Возврат ИдентификаторКластера;
	
КонецФункции   

&НаСервере
Процедура УстановитьМакетОписанияКластера()
	
	Попытка
		ТаблицаСводнойИнформации = Справочники.КластерСервераПриложений.ПолучитьМакетОписанияКластера(Объект.Ссылка);
	Исключение
		// TODO:
	КонецПопытки	

КонецПроцедуры // УстановитьМакетОписанияКластера()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКластера) Тогда
		УстановитьИдентификатор(Параметры);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСводнойИнформацииОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОбработки = Неопределено;
	Если Расшифровка.Свойство("ПараметрыБазы", ПараметрыОбработки) Тогда
		//ОбработатьРегистрациюИнформационнойБазы(ПараметрыОбработки);
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ПараметрыБазы", ПараметрыОбработки);
		ДополнительныеПараметры.Вставить("Кластер", Объект.Ссылка);
		
		ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта", Новый Структура("ДополнительныеПараметры", ДополнительныеПараметры));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОКластере(Команда)
	
	УстановитьМакетОписанияКластера();	
	
КонецПроцедуры
